<a href="https://colab.research.google.com/github/gudiya-archi/Data-science/blob/main/pandas1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# series from lists

# string
country = ['india','pakistan','USA','Nepal','Srilanka']
pd.Series(country)

0       india
1    pakistan
2         USA
3       Nepal
4    Srilanka
dtype: object

In [ ]:
# integers
runs = [13,24,56,78,100]
pd.Series(runs)

0     13
1     24
2     56
3     78
4    100
dtype: int64

In [ ]:
# custom index
marks = [67,57,89,100]
subjects = ['maths','english','science','hindi']

pd.Series(marks,index=subjects)

maths       67
english     57
science     89
hindi      100
dtype: int64

In [ ]:
# setting a name
marks = pd.Series(marks,index=subjects,name='Nitish ke marks')
marks

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# series from dict
marks ={
    'maths':67,
    'english':57,
    'science':89,
    'hindi':100
}

marks_series = pd.Series(marks, name='Nitish ke marks')
marks_series

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# series attributes
marks

{'maths': 67, 'english': 57, 'science': 89, 'hindi': 100}

In [ ]:
marks_series

maths       67
english     57
science     89
hindi      100
Name: Nitish ke marks, dtype: int64

In [ ]:
# size
marks_series.size

4

In [ ]:
# dtype
marks_series.dtype

dtype('int64')

In [ ]:
# name
marks_series.name

'Nitish ke marks'

In [ ]:
# is_unique
marks_series.is_unique

True

In [ ]:
import pandas as pd
marks_series.is_unique
pd.series([1,1,2,3,4,5]).is_unique

AttributeError: module 'pandas' has no attribute 'series'

In [ ]:
# index

marks_series.index

Index(['maths', 'english', 'science', 'hindi'], dtype='object')

In [ ]:
# integers
runs = [13,24,56,78,100]
runs_ser = pd.Series(runs)

In [ ]:
runs_ser.index

RangeIndex(start=0, stop=5, step=1)

In [ ]:
type(runs_ser.index)

pandas.core.indexes.range.RangeIndex

In [ ]:
# values
marks_series.values

array([ 67,  57,  89, 100])

In [ ]:
type(marks_series.values)

numpy.ndarray

In [ ]:
# series using read_csv
# with one col